Conf.Simple/src/Catalogs/SUI_ШаблоныЭтикетокZPL/SUI_ШаблоныЭтикетокZPL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_ШаблоныЭтикетокZPL</name>
  <attributes>
    <name>ВыполнятьЗапросВПакетномРежиме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодZPL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитDataMatrix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПакетыРезультатаЗапроса</name>
    <attributes>
      <name>ИндексРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_ШаблоныЭтикетокZPL/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		ХранилищеКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Картинка");
		
		Если ТипЗнч(ХранилищеКартинки) = Тип("ХранилищеЗначения") Тогда
			ДвоичныеДанныеКартинки = ХранилищеКартинки.Получить();
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ДвоичныеДанныеКартинки = Параметры.ЗначениеКопирования.Картинка.Получить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьАдресКартинки();	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуетсяОбновитьКартинку Тогда
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(Неопределено);
	Иначе
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ДвоичныеДанныеКартинки, Новый СжатиеДанных(9));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("SUI_ЗаписьШаблонаЭтикеткиZPL", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЭтоАдресВременногоХранилища(КартинкаПредпросмотр) Тогда
		УдалитьИзВременногоХранилища(КартинкаПредпросмотр);
		КартинкаПредпросмотр = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШиринаММПриИзменении(Элемент)
	УстановитьПризнакТребованияОбновленияКартинкиПредпросмотра();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаММПриИзменении(Элемент)
	УстановитьПризнакТребованияОбновленияКартинкиПредпросмотра();
КонецПроцедуры

&НаКлиенте
Процедура КодZPLПриИзменении(Элемент)
	УстановитьПризнакТребованияОбновленияКартинкиПредпросмотра();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура ПримерШаблонаEN(Команда)
	ЗаполнитьПримерКодаZPL_EN();
КонецПроцедуры

&НаКлиенте
Процедура ПримерШаблонаRU(Команда)
	ЗаполнитьПримерКодаZPL_RU();
КонецПроцедуры

&НаКлиенте
Процедура ZPLПредпросмотр(Команда)
	ОбновитьКартинкуПредпросмотра();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросПолученияДанных(Команда)
	
	ПараметрыОткрытияКонструктора = SUI_КонструкторЗапросаКлиентСервер.ПараметрыОткрытияКонструктора();
	ПараметрыОткрытияКонструктора.Данные.ТекстЗапроса = Объект.ТекстЗапроса;
	ПараметрыОткрытияКонструктора.Данные.ВыполнятьВПакетномРежиме = Объект.ВыполнятьЗапросВПакетномРежиме;
	ПараметрыОткрытияКонструктора.Данные.ПакетыРезультата = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из Объект.ПакетыРезультатаЗапроса Цикл
		ПараметрыОткрытияКонструктора.Данные.ПакетыРезультата.Добавить(СтрокаТаблицы.ИндексРезультата);
	КонецЦикла;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьЗапросПолученияДанныхЗавершение", ЭтотОбъект);
	
	SUI_КонструкторЗапросаКлиент.ОткрытьКонструктор(ПараметрыОткрытияКонструктора, ОповещениеОЗавершении, ЭтотОбъект, Окно);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПримерКодаZPL_EN()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
    	Объект.Наименование = НСтр("ru = 'Шаблон этикетки (101х152) (EN)'");
	КонецЕсли;
	
	Объект.ШиринаММ = 101.6;
	Объект.ВысотаММ = 152.4;
	Объект.КодZPL = "^XA
	|
	|^FX Top section with logo, name and address.
	|^CF0,60
	|^FO50,50^GB100,100,100^FS
	|^FO75,75^FR^GB100,100,100^FS
	|^FO93,93^GB40,40,40^FS
	|^FO220,50^FDIntershipping, Inc.^FS
	|^CF0,30
	|^FO220,115^FD1000 Shipping Lane^FS
	|^FO220,155^FDShelbyville TN 38102^FS
	|^FO220,195^FDUnited States (USA)^FS
	|^FO50,250^GB700,3,3^FS
	|
	|^FX Second section with recipient address and permit information.
	|^CFA,30
	|^FO50,300^FDJohn Doe^FS
	|^FO50,340^FD100 Main Street^FS
	|^FO50,380^FDSpringfield TN 39021^FS
	|^FO50,420^FDUnited States (USA)^FS
	|^CFA,15
	|^FO600,300^GB150,150,3^FS
	|^FO638,340^FDPermit^FS
	|^FO638,390^FD123456^FS
	|^FO50,500^GB700,3,3^FS
	|
	|^FX Third section with bar code.
	|^BY5,2,270
	|^FO100,550^BC^FD12345678^FS
	|
	|^FX Fourth section (the two boxes on the bottom).
	|^FO50,900^GB700,250,3^FS
	|^FO400,900^GB3,250,3^FS
	|^CF0,40
	|^FO100,960^FDCtr. X34B-1^FS
	|^FO100,1010^FDREF1 F00B47^FS
	|^FO100,1060^FDREF2 BL4H8^FS
	|^CF0,190
	|^FO470,955^FDCA^FS
	|
	|^XZ";
	
КонецПроцедуры // ЗаполнитьПримерКодаZPL_EN()

&НаКлиенте
Процедура ЗаполнитьПримерКодаZPL_RU()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
    	Объект.Наименование = НСтр("ru = 'Шаблон этикетки (58х40) (RU)'");
	КонецЕсли;
	
	Объект.ШиринаММ = 58;
	Объект.ВысотаММ = 40;
	Объект.КодZPL = "^XA
	|^CI28
	|^CF0,20
	|^FO22,5^FD[Магазин]^FS
	|^CF0,20
	|^FO320,25^FDРАЗМЕР:^FS
	|^FO300,50^FD[Размерь]^FS
	|^FO22,25^FD[Наименование]^FS
	|^FO22,50,2^FDАРТИКУЛ: [Артикул]  [Размер]^FS
	|^CF0,15
	|^FO22,75^FDСостав верха:^FS
	|^FO112,75^FD[СоставВерха]^FS
	|^FO22,95^FDПокладка:^FS
	|^FO112,95^FD[Подкладка]^FS
	|^FO22,115^FDПодошва:^FS
	|^FO112,115^FD[Подошва]^FS
	|^FO22,135^FDДоп инфо:^FS
	|^FO112,135^FD[ДопИнфо]^FS
	|^FO22,155^FDСделано в:^FS
	|^FO112,155^FD[Сделано]^FS
	|^CF0,50
	|^FO290,102^GFA,750,750,10,,:::::::0IFE03KF80IFE,:::::0IFE03FC07F80IFE,0FEI03FC07F80IFE,0FEI03FC07F80FF,:::::::::::::::::0IFE03KF80FF,::::0IFC03KF80FF,0FEI03FC07F80FF,:::::::::::::::::0FFI03FC07F80IFE,0IFE03FC07F80IFE,::::::,::::::::^FS
	|^CF0,20
	|^FO370,115^FDДАТА^FS
	|^FO370,145^FD[Дата]^FS
	|^CF0,25
	|^FO22,175^FD[ПредставлениеСтаройЦены]^FS
	|^FO80,200^FD[ЦенаСтарая]^FS
	|^FO22,230^FDЦЕНА^FS
	|^CF0,20
	|^FO100,235^FD[ПредставлениеСкидки]^FS
	|^FO200,235^FD[ПроцентСкидки]^FS
	|^CF0,25
	|^FO80,255^FD[ЦенаНовая]^FS
	|^CF0,13
	|^FO22,285^FDИмпортер:^FS
	|^FO22,300^FDПроизводитель:^FS
	|^FO140,285^FD[Поставщик]^FS
	|^FO140,300^FD[Производитель]^FS
	|^CF0,20
	|^FO260,185
	|^BY2,2,30
	|^BEN,,N,N,N,A
	|^FD[Штрихкод]^FS
	|^XZ";
	
КонецПроцедуры // ЗаполнитьПримерКодаZPL_RU()

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ШиринаММ) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена ширина шаблона этикетки'"), , "ШиринаММ", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВысотаММ) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена высота шаблона этикетки'"), , "ВысотаММ", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КодZPL) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен код ZPL шаблона этикетки'"), , "КодZPL", "Объект", Отказ);
	ИначеЕсли Лев(Объект.КодZPL, 3) <> "^XA" Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Код ZPL содержит ошибки. Код ZPL должен начинаться на ""^XA""'"), , 
			"КодZPL", "Объект", Отказ);
	ИначеЕсли Прав(Объект.КодZPL, 3) <> "^XZ" Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Код ZPL содержит ошибки. Код ZPL должен оканчиваться на ""^XZ""'"), , 
			"КодZPL", "Объект", Отказ);
	КонецЕсли; 
	
	Возврат Не Отказ;
	
КонецФункции // ПроверитьЗаполнениеРеквизитов()

&НаКлиенте
Процедура ОбновитьКартинкуПредпросмотра()
	
	Если ЭтоАдресВременногоХранилища(КартинкаПредпросмотр) Тогда
		УдалитьИзВременногоХранилища(КартинкаПредпросмотр);
	КонецЕсли;
	
	КартинкаПредпросмотр = "";
	Элементы.КартинкаПредпросмотр.Подсказка = "";
	
	Если ПроверитьЗаполнениеРеквизитов() Тогда
		
		ПараметрыZPL = Новый Структура();
		
		ПараметрыZPL.Вставить("ШиринаВДюймах", Формат(Окр(Объект.ШиринаММ / 25.4, 3, РежимОкругления.Окр15как20), "ЧЦ=4; ЧДЦ=3; ЧРД=."));	
		ПараметрыZPL.Вставить("ВысотаВДюймах", Формат(Окр(Объект.ВысотаММ / 25.4, 3, РежимОкругления.Окр15как20), "ЧЦ=4; ЧДЦ=3; ЧРД=."));
		ПараметрыZPL.Вставить("Код", СокрЛП(Объект.КодZPL));
		
		Результат = ПолучитьДанныеКартинкиШаблонаИзСервиса(ПараметрыZPL);
		
		ДвоичныеДанныеКартинки = Результат.Картинка;
		Элементы.КартинкаПредпросмотр.ТекстНевыбраннойКартинки = Результат.Ошибка;
		
		ТребуетсяОбновитьКартинку = Ложь;
		Элементы.ИнформацияОбОбновленииКартинки.Заголовок = "";
		
		ОбновитьАдресКартинки();
	
	КонецЕсли;
	
	ОбновитьАдресКартинки();

КонецПроцедуры // ОбновитьКартинкуПредпросмотра()

&НаКлиенте
Функция ПолучитьДанныеКартинкиШаблонаИзСервиса(ПараметрыZPL)
	
	Данные = Новый Структура("Картинка, Ошибка", Неопределено, "");
	
	ДвоичныеДанныеКартинки = Неопределено;
	
	СтруктураURI = SUI_ОбщегоНазначенияКлиентСервер.СтруктураURI(
		"https://api.labelary.com/v1/printers/8dpmm/labels/" + ПараметрыZPL.ШиринаВДюймах + "x" + ПараметрыZPL.ВысотаВДюймах + "/0/");
	
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт, , , , 10, Новый ЗащищенноеСоединениеOpenSSL);

	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);                                           
	
	HTTPЗапрос.Заголовки.Вставить("Accept", 		"image/png");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", 	"application/x-www-form-urlencoded");
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыZPL.Код, КодировкаТекста.UTF8);
	
	Попытка
		Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Если Результат.КодСостояния = 200 Тогда
		Данные.Картинка = Результат.ПолучитьТелоКакДвоичныеДанные();
	Иначе
		Данные.Ошибка = Результат.ПолучитьТелоКакСтроку();
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка получения данных изображения из сервиса. Код состояния: %1. 
                 |Текст ошибки: %2'"), Результат.КодСостояния, Данные.Ошибка));
	КонецЕсли;
	
	Возврат Данные;	

КонецФункции // ПолучитьДанныеКартинкиШаблонаНаСервере()

&НаКлиенте
Процедура ОбновитьАдресКартинки()
	
	Если ЭтоАдресВременногоХранилища(КартинкаПредпросмотр) Тогда
		УдалитьИзВременногоХранилища(КартинкаПредпросмотр);
	КонецЕсли;
	
	Если ТипЗнч(ДвоичныеДанныеКартинки) = Тип("ДвоичныеДанные") Тогда
		КартинкаПредпросмотр = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
	Иначе 
		КартинкаПредпросмотр = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КартинкаПредпросмотр) И Не ЗначениеЗаполнено(Элементы.КартинкаПредпросмотр.ТекстНевыбраннойКартинки) Тогда
		Элементы.КартинкаПредпросмотр.ТекстНевыбраннойКартинки = НСтр("ru = 'Отсутствует изображение шаблона'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакТребованияОбновленияКартинкиПредпросмотра()
	ТребуетсяОбновитьКартинку = Истина;
	Элементы.ИнформацияОбОбновленииКартинки.Заголовок = НСтр("ru = 'Параметры шаблона были изменены. Обновите картинку предпросмотра.'");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросПолученияДанныхЗавершение(ПараметрыКонструктора, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыКонструктора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекстЗапроса = ПараметрыКонструктора.ТекстЗапроса;
	Объект.ВыполнятьЗапросВПакетномРежиме = ПараметрыКонструктора.ВыполнятьВПакетномРежиме;
	
	Объект.ПакетыРезультатаЗапроса.Очистить();
	Для индекс = 0 По ПараметрыКонструктора.ПакетыРезультата.ВГраница() Цикл
		НоваяСтрока = Объект.ПакетыРезультатаЗапроса.Добавить();
		НоваяСтрока.ИндексРезультата = ПараметрыКонструктора.ПакетыРезультата[индекс];
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
